apitests/registerTextKeyUser.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" >
 <soap:Body>
  <registerTextKeyUser_Key xmlns="https://secure.textkey.com/services/">
   <apiKey>PUT API KEY HERE</apiKey>
   <command>Query</command>
   <cellNumber>1231231234</cellNumber>
   <ownerFName>
   </ownerFName>
   <ownerLName>
   </ownerLName>
   <suppl1>
   </suppl1>
   <suppl2>
   </suppl2>
   <userID>
   </userID>
   <isHashed>true</isHashed>
   <TextKeyMode>TextKeyOnly</TextKeyMode>
   <ReceiveMode>AnyCode</ReceiveMode>
   <pinCode>
   </pinCode>
   <distressPinCode>
   </distressPinCode>
  </registerTextKeyUser_Key>
 </soap:Body>
</soap:Envelope>
